drag-drop/app/controllers/media_contents_controller.rb

  def index
    @media_contents = Media.all
---
SELECT "media".* FROM "media"

 def create
    @media = Media.new(file_name: params[:file])
    if @media.save!
---
INSERT INTO "media" ("created_at", "file_name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2015-06-13 17:53:11.745050"], ["file_name", "maks1.jpg"], ["updated_at", "2015-06-13 17:53:11.745050"]]

def delete_media
  Media.where(id: params[:media_contents]).destroy_all
---
DELETE FROM "media" WHERE "media"."id" = ?  [["id", 1]]
SELECT "media".* FROM "media"  WHERE "media"."id" IN (1)